CSI API ETABS v1
cPointObj.GetRestraint Method
 Retrieves the restraint assignments for a point object. The restraint assignments are always returned in the point local coordinate system.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRestraint(
	string Name,
	ref bool[] Value
)
Function GetRestraint (
	Name As String,
	ByRef Value As Boolean()
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim Value As Boolean()
Dim returnValue As Integer
returnValue = instance.GetRestraint(Name,
	Value)
int GetRestraint(
	String^ Name,
	array<bool>^% Value
)
abstract GetRestraint :
        Name : string *
        Value : bool[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing point object.
Value
Type: System.Boolean[]
 This is an array of six restraint values.
Value(0) = U1
Value(1) = U2
Value(2) = U3
Value(3) = R1
Value(4) = R2
Value(5) = R3
Return Value
Type: Int32
 Returns zero if the restraint assignments are successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'get point object restraints
       Redim Value(5)
       ret = SapModel.PointObj.GetRestraint("65", Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace